In [ ]:
import pandas as pd

In [ ]:
ufo = pd.read_csv(r"http://bit.ly/uforeports")

In [ ]:
ufo.tail()

In [ ]:
ufo.isnull().tail()

In [ ]:
ufo.notnull().tail()

In [ ]:
# Mostra a quantidade de valores nulos em cada coluna
ufo.isnull().sum()

In [ ]:
# Filtrar por coluna onde o valor Ã© nulo
ufo[ufo['City'].isnull()]

In [18]:
ufo[(ufo['City'].isnull()) & (ufo['Colors Reported'].isnull())].reset_index()

    index City Colors Reported Shape Reported State              Time
0      21  NaN             NaN        VARIOUS    LA    8/15/1943 0:00
1      22  NaN             NaN          LIGHT    LA    8/15/1943 0:00
2     204  NaN             NaN           DISK    CA   7/15/1952 12:30
3     613  NaN             NaN           DISK    NV    7/1/1960 12:00
4    2013  NaN             NaN        VARIOUS    NH     8/1/1970 9:30
5    2546  NaN             NaN       FIREBALL    OH  10/25/1973 23:30
6    4736  NaN             NaN         SPHERE    CA   6/23/1982 23:00
7    5269  NaN             NaN        VARIOUS    AZ   6/30/1985 21:30
8    6113  NaN             NaN          OTHER    CO   6/30/1989 22:30
9    6735  NaN             NaN      FORMATION    TX     4/1/1992 2:00
10   7208  NaN             NaN         CIRCLE    MI   10/4/1993 17:30
11   8828  NaN             NaN       TRIANGLE    WA  10/30/1995 21:30
12   8967  NaN             NaN        VARIOUS    CA   12/8/1995 18:00
13   9273  NaN             NaN       TRIANGLE    OH     5/1/1996 3:00
14   9388  NaN             NaN           OVAL    CA   6/12/1996 12:00
15   9587  NaN             NaN            EGG    FL   8/24/1996 15:00
16  10399  NaN             NaN       TRIANGLE    IL   6/15/1997 23:00
17  11625  NaN             NaN         CIRCLE    TX     6/7/1998 7:00
18  15767  NaN             NaN      RECTANGLE    NV   1/21/2000 11:30
19  15812  NaN             NaN          LIGHT    NV     2/2/2000 3:00
20  16608  NaN             NaN         SPHERE    NY   6/15/2000 15:00

In [16]:
# Remove as rows onde city e Colors Reported estÃ£o NaN
ufo.dropna(subset=['City','Colors Reported'],how='all')
# Ou remove todas as rows que tiverem algum valor NaN
ufo.dropna()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,VARIOUS,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [ ]:
# Value Counts com dropna conta os valores NaN que aparecem na coluna tbm
ufo['Shape Reported'].value_counts(dropna=False)

In [13]:
# Usando fillna pra preencher os NaN
ufo['Shape Reported'].fillna(value="VARIOUS",inplace=True)
ufo['Shape Reported'].value_counts()

Shape Reported
VARIOUS      2977
LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
ROUND           2
CRESCENT        2
DOME            1
PYRAMID         1
FLARE           1
HEXAGON         1
Name: count, dtype: int64